# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv8-seg instance segmentation model. For Usage examples see https://docs.ultralytics.com/tasks/segment

# Parameters
nc: 80  # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n-seg.yaml' will call yolov8-seg.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 768]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.25, 512]

# YOLOv8.0n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]
  - [-1, 1, Conv, [128, 3, 2]] 
  - [-1, 3, C2f, [128, True]] 
  - [-1, 1, Conv, [128, 3, 2]]  

  - [-1, 6, C2f, [256, True]] 
  - [-1, 1, Conv, [128, 3, 2]]  

  - [-1, 6, C2f, [512, True]] 
  - [-1, 1, Conv, [128, 3, 2]]  

  - [-1, 3, C2f, [1024, True]] 
  - [-1, 1, SPPF, [1024, 5]] #9

# YOLOv8.0n head
head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] #14
  - [[-1, 6], 1, Concat, [1]]  # cat backbone P4 #15
  - [-1, 3, C2f, [512]]  # 16
  - [ -1,1, BiLevelRoutingAttention,[2]]
  # - [ -1,1, CrissCrossAttention,[1]]


  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] #17
  - [[-1, 4], 1, Concat, [1]]  # cat backbone P3 18
  - [-1, 3, C2f, [256]]  # 19 (P3/8-small)
  - [ -1,1, BiLevelRoutingAttention,[2]]
  # - [ -1,1, CrissCrossAttention,[1]]


  - [-1, 1, Conv, [256, 3, 2]] #20
  - [[-1, 12], 1, Concat, [1]]  # 21cat head P4
  - [-1, 3, C2f, [512]]  # 22 (P4/16-medium)
  - [ -1,1, BiLevelRoutingAttention,[2]]
  # - [ -1,1, CrissCrossAttention,[1]]

  - [-1, 1, Conv, [512, 3, 2]] #23
  - [[-1, 9], 1, Concat, [1]]  # 24 cat head P5
  - [-1, 3, C2f, [1024]]  # 25 (P5/32-large)
  - [ -1,1, BiLevelRoutingAttention,[2]]
  # - [ -1,1, CrissCrossAttention,[1]]

  - [[17,21, 25], 1, Segment, [nc, 32, 256]]  # Segment(P3, P4, P5)
